       IDENTIFICATION DIVISION.
       PROGRAM-ID. maxoftwo.
       DATA DIVISION.
       LINKAGE SECTION.

       PROCEDURE DIVISION.

           EXIT PROGRAM.